Org note taking and refiling using org-dropbox.  See
http://heikkil.github.io/blog/2015/05/07/notes-in-org-agenda/ 

#+begin_src emacs-lisp
(use-package org-dropbox
  :ensure t
)





(global-set-key "\C-ca" 'org-agenda)
(require 'org-agenda)
;(setq org-directory "~/Dropbox/org")
(global-set-key "\C-cc" 'org-capture)
(add-to-list 'org-capture-templates
              '("n" "note" entry (file+datetree "~/org/reference.org")
               "* %?\nEntered on %U\n  %i\n  %a"))

(setq org-tag-alist (quote (("BIO"    . ?b)
                           ("COMP"    . ?c)
                           ("EMACS"   . ?e)
                           ("FOOD"    . ?f))))


(setq org-dropbox-note-dir      "~/Dropbox/notes/")
(setq org-dropbox-datetree-file "~/Dropbox/org/reference.org")
(org-dropbox-mode)

(message "org-dropbox setup done")
#+end_src

#+RESULTS:
: org-dropbox setup done

